Revit 2027 API
ParameterValueProvider Methods
The ParameterValueProvider type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from FilterableValueProvider)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAssociatedGlobalParameterValue |  Gets a global parameter value associated with a parameter from the given element.
(Inherited from FilterableValueProvider)
GetDoubleValue |  Gets a double-precision numeric value from the given element.
(Inherited from FilterableValueProvider)
GetElementIdValue |  Gets an ElementId value from the given element.
(Inherited from FilterableValueProvider)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetIntegerValue |  Gets an integer value from the given element.
(Inherited from FilterableValueProvider)
GetStringValue |  Gets a string value from the given element.
(Inherited from FilterableValueProvider)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsDoubleValueSupported |  Determines whether the provide can provide a double-precision numeric value for the given element.
(Inherited from FilterableValueProvider)
IsElementIdValueSupported |  Determines whether the provide can provide an ElementId value for the given element.
(Inherited from FilterableValueProvider)
IsIntegerValueSupported |  Determines whether the provide can provide an integer value for the given element.
(Inherited from FilterableValueProvider)
IsStringValueSupported |  Determines whether the provide can provide a string value for the given element.
(Inherited from FilterableValueProvider)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ParameterValueProvider Class
Autodesk.Revit.DB Namespace